// ニュースデータ
const NEWS_DATA = [
    {
      "date": "2026/02/27",
      "title": "利用規約アップデート",
      "body": "いつもプレイしていただきありがとうございます。\n本日より『Spaceliner』の利用規約および権利表記を更新いたしました。\n今回の更新では、主に「団体名称の適正化（法人表記の削除）」および「外部音源提供者様の権利保護の明確化」を行っております。 あわせて、トラブル防止のための禁止事項や違反時の対処についても詳細を追加しました。\n開発チームは、素材を提供してくださるクリエイター様およびプレイヤーの皆様の権利を尊重し、健全なコミュニティ運営を目指しております。",
      "linkUrl": ""
    },
    {
      "date": "2026/02/26",
      "title": "プレビュー版配信開始！",
      "body": "いつもプレイしていただきありがとうございます。\n本日より音楽ゲーム『spaceliner』のプレビュー版を配信いたしました。\n『spaceliner』は『音奏』の次世代ゲームとなっています\nぜひダウンロードしてください。\nspaceliner公式ウェブサイトへはURLのボタンから！",
      "linkUrl": "https://onsou2025.github.io/Spaceliner/#download"
    },
    {
      "date": "2026/02/08",
      "title": "新楽曲追加！",
      "body": "いつもプレイしていただきありがとうございます。\n本日より音楽ゲーム”音奏”から楽曲「」を追加いたします。\nOVERDRIVE譜面は”MASTERから完全移植となっています！\nぜひ今までと、一つも二つも違う譜面をお楽しみください。\n音奏公式ウェブサイトへはURLのボタンから！",
      "linkUrl": "https://onsou2025.github.io/ONSOU-Home/"
    },
    {
      "date": "2026/02/06",
      "title": "公式Xをフォローしよう！",
      "body": "最新情報は公式Xで発信中です。\nぜひチェックしてください！",
      "linkUrl": ""
    },
    {
      "date": "2026/02/01",
      "title": "メンテナンス終了",
      "body": "修正が完了しました。ご協力ありがとうございました。",
      "linkUrl": ""
    }
];

// FAQデータ (support.html用)
const FAQ_DATA = [
    {
        q: "プレイ映像をSNSに配信したいのですが大丈夫ですか？",
        a: "プレイ映像を配信していただくことは可能です。ただし、利用規約の内容に準じます。"
    },
    {
        q: "不具合を見つけた場合はどのようにすればいいですか？",
        a: "不具合を発見された場合は速やかにゲームを終了し、公式ディスコードサーバにて報告を行ってください。"
    },
    {
        q: "難易度の選択方法がわかりません",
        a: "難易度選択の場合、楽曲選択画面（選択画面）で左右キーを押していただくことで変更いただけます。"
    },
    {
        q: "ゲームが起動しません。",
        a: "コンピューターでの再起動をかけてください。治らない場合は、再度インストーラーをダウンロードしていただき、インストーラーの指示に従い再インストールしてください。"
    },
    {
        q: "セキュリティ警告が表示されます。",
        a: "個人開発のソフトであるため、Windows SmartScreen等で警告が出る場合があります。「詳細情報」をクリックし「実行」を選択してください。"
    }
];

